Repository: 84000/data-translation-memory
Catalog: toh350-v3.tmx
Source language: bo
Languages: en

source: ཨེ་མའོ་བདག་དབུལ་ཏེ་འདི་ལྟར་འཛམ་བུའི་གླིང་གི་དབང་ཕྱུག་དམ་པ་བྱས་ཀྱིས་ཀྱང་དྲང་སྲོང་གཅིག་ལ་བསོད་སྙོམས་དབུལ་བར་མ་ནུས་སོ། །
en: Even though I have dominion over Jambudvīpa, I am not able to provide alms to even a single sage!’

source: དེ་ནས་རྒྱལ་པོའི་ཕོ་བྲང་གསེར་ཅན་ན་གནས་པའི་ལྷ་དེས། རྒྱལ་པོ་གསེར་མདོག་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། ཅི་ཞིག་སྡུག་བསྔལ་ཡིན་ཞེ་ན་ནི་དབུལ་བའོ། །
en: “Then the deity of the royal capital Kanakāvatī uttered this verse to King Kanakavarṇa: What is suffering?

source: ཤིན་ཏུ་སྡུག་བསྔལ་གང་ཡིན་དབུལ་བ་དེ་ཉིད་དེ། །
en: It is to be poor. What is greater suffering?

source: དབུལ་བ་དག་ནི་ནང་ན་ཤི་དང་མཚུངས་པར་གྱུར་པ་སྟེ། །
en: It is poverty itself. To be in poverty is the same as death.

source: བདག་ནི་ཤི་ཡང་བླ་ཡི་དབུལ་བ་མི་འདོད་དོ། །
en: I would not choose poverty over death!

source: དེ་ནས་རྒྱལ་པོ་གསེར་མདོག་གིས་མཛོད་པ་བོས་ནས། འདི་སྐད་ཅེས་སྨྲས་སོ། །གྲོང་གི་གཙོ་བོ་ཁྱིམ་ན་བཟའ་བ་ཅུང་ཟད་ཡོད་ན་དྲང་སྲོང་འདི་ལ་དབུལ་བར་བྱའོ། །
en: “King Kanakavarṇa then summoned the person in charge of the storehouse and asked, ‘Sir, is there any food in the house that I could offer to this sage?’

source: དེས་སྨྲས་པ། གང་ལྷ་ཉིད་མཁྱེན་པ་ལགས་ཏེ། འཛམ་བུའི་གླིང་གི་ཟས་ལ་སོགས་པ་ཐམས་ཅད་ཡོངས་སུ་བས་སོ། །གཞན་དུ་ན་ལྷ་ཉག་གཅིག་བཤོས་ཀྱི་ལྷག་མ་བྲེའུ་ཆུང་གང་ཞིག་མཆིས་སོ། །
en: “‘Your Majesty,’ he replied, ‘Please know that all the food in Jambudvīpa has been exhausted apart from a single measure of food that remains for Your Majesty.’

source: དེ་ནས་རྒྱལ་པོ་གསེར་མདོག་འདི་སྙམ་དུ་གྱུར་ཏེ།
en: “King Kanakavarṇa thought, ‘If I eat it, I will live.

source: གལ་ཏེ་ཟོས་ན་ནི་འཚོ་ཅི་སྟེ་མ་ཟོས་ན་ནི་འཆིའོ་སྙམ་མོ། །
en: If I do not eat it, I will die.’

source: དེ་ཡང་འདི་སྙམ་དུ་གྱུར་ཏེ། གལ་ཏེ་ཟོས་ཀྱང་ངེས་པར་བདག་འཆི་བར་འགྱུར་ཏེ།
en: But then he thought, ‘Even if I eat it, I will certainly come to die—enough of this life of mine!

source: འཚོ་བས་ཆོག་གིས་ཇི་ལྟར་ན་འདི་འདྲ་བའི་དྲང་སྲོང་ཚུལ་ཁྲིམས་དང་ལྡན་པ་དགེ་བའི་ཆོས་ཅན་དེ།
en: How could such a virtuous and excellent sage leave my house today with an alms bowl as pristine as before he entered?’

source: དེ་ནས་རྒྱལ་པོ་གསེར་མདོག་གིས་རྩིས་པ་དང་། སྣ་ཆེན་པོ་ལ་གཏོགས་པ་དང་། སྒོ་བ་དང་། འཁོར་རྣམས་བསྡུས་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །གྲོང་གི་གཙོ་བོ་དག་ཀྱི་ཧུད།
en: “King Kanakavarṇa then gathered his accountants, ministers, courtiers, gatekeepers, and councilors, and said, ‘Please rejoice, sirs!

source: འདི་ནི་གསེར་མདོག་གི་སྦྱིན་པ་གཏོང་བ་ཐ་མ་ཡིན་ཏེ།
en: This is King Kanakavarṇa’s final act of charity.

source: རྗེས་སུ་ཡི་རང་བར་གྱིས་ཤིག །དགེ་བའི་རྩ་བ་འདིས་འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་ཀྱི་དབུལ་བ་ཡང་དག་པར་གཅོད་པར་གྱུར་ཅིག །
en: By this root of virtue, may there be a complete end to poverty for all the people of Jambudvīpa.’

source: དེ་ནས་རྒྱལ་པོ་གསེར་མདོག་གིས་ཟས་བྲེའུ་ཆུང་གང་ཡོད་པ་དེ། བཅོམ་ལྡན་འདས་རང་སངས་རྒྱས་དེའི་ལྷུང་བཟེད་དུ་བླུགས་ནས། བཅོམ་ལྡན་འདས་རང་སངས་རྒྱས་དེའི་ལག་པ་གཡས་པར་ལྷུང་བཟེད་བྱིན་ནོ། །
en: “Thereupon King Kanakavarṇa put all there was of the measure of food into the bowl of that blessed pratyekabuddha and gave the bowl into the blessed pratyekabuddha’s right hand.

source: གང་རང་སངས་རྒྱས་ཀྱི་ལུས་ཀྱིས་ཆོས་སྟོན་པ་ནི་ཆོས་ཉིད་དེ་ཚིག་གིས་ནི་མ་ཡིན་ནོ། །
en: “Now, it is in the nature of things that blessed pratyekabuddhas teach the Dharma bodily, not verbally.

source: དེ་ནས་བཅོམ་ལྡན་འདས་རང་སངས་རྒྱས་དེ་རྒྱལ་པོ་གསེར་མདོག་གི་བསོད་སྙོམས་བླངས་ནས། འདི་ལྟར་རྫུ་འཕྲུལ་གྱིས་ནམ་མཁའ་ལ་སོང་ངོ་། །
en: So the blessed pratyekabuddha received the alms from King Kanakavarṇa and, in this way by miraculous ability, departed into the sky.

source: དེ་ནས་རྒྱལ་པོ་གསེར་མདོག་ཐལ་མོ་སྦྱར་ནས། མིག་རྒྱང་གིས་སོད་དག་གི་བར་དུ་མིག་མི་འཛུམས་པར་བལྟས་སོ། །དེ་ནས་རྒྱལ་པོ་གསེར་མདོག་གིས། རྩིས་པ་དང་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་དང་།
en: With folded hands, King Kanakavarṇa stood looking on, without blinking, until he had passed from sight.

source: བློན་པོ་དང་། སྒོ་བ་དང་། འཁོར་རྣམས་བོས་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །གྲོང་གི་གཙོ་བོ་དག་རང་རང་གི་གནས་ཇི་ལྟ་བ་བཞིན་དེངས་ཤིག །
en: “Then King Kanakavarṇa summoned his accountants, ministers, courtiers, gatekeepers, and councilors, and said, ‘Sirs, go to your respective homes.

source: ཁང་བཟངས་འདིར་བཀྲེས་པ་དང་སྐོམ་པས་འཆི་བའི་དུས་མ་བྱེད་ཅིག །དེ་དག་གིས་སྨྲས་པ།
en: Please do not end your time by dying from hunger and thirst here at the palace.’

source: གང་གི་ཚེ་ལྷའི་དཔལ་དང་སྐུ་སྐལ་དང་ལྡན་པར་གྱུར་པ་དེའི་ཚེ། བདག་ཅག་ལྷའི་ཞབས་འབྲིང་ན་རྩེ་ཞིང་དགའ་ལ་ལོངས་སྤྱོད་པ་ལགས་ན།
en: “They replied, ‘When Your Majesty possessed wealth and good fortune, we amused and enjoyed ourselves together with Your Majesty.

source: འདི་ལྟ་སྟེ་བདག་ཅག་ལྷའི་དུས་ཕྱི་མ་དང་དུས་ཚོད་ཕྱི་མ་ཡོངས་སུ་གཏང་བ་ག་ལ་ཞིག་བཟོད།
en: How could we now abandon Your Majesty at the end, at this final hour?’

source: དེ་ནས་རྒྱལ་པོ་གསེར་མདོག་རབ་ཏུ་ངུས་ཏེ་མཆི་མ་ཕྱུང་ངོ་། །
en: “Then, King Kanakavarṇa broke down in tears and wept.

source: མཆི་མ་དེ་ལེགས་པར་ཕྱིས་ནས་རྩིས་པ་དང་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་དང་བློན་པོ་དང་སྒོ་བ་དང་འཁོར་རྣམས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གྲོང་གི་གཙོ་བོ་དག་རང་རང་གི་གནས་ཇི་ལྟ་བ་བཞིན་དེངས་ཤིག །
en: Wiping away his tears, he again said to his accountants, ministers, courtiers, gatekeepers, and councilors, ‘Sirs, go to your respective homes.

source: ཐམས་ཅད་ཀྱིས་ཁང་བཟངས་འདིར་བཀྲེས་པ་དང་སྐོམ་པ་དག་གིས་འཆི་བའི་དུས་མ་བྱེད་ཅིག །
en: All of you, please do not end your time by dying from hunger and thirst here at the palace.’

source: དེ་ནས་རྩིས་པ་དང་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་དང་བློན་པོ་དང་། སྒོ་བ་དང་འཁོར་རྣམས་རབ་ཏུ་ངུས་ཏེ་མཆི་མ་ཕྱུང་ངོ་། །
en: “At this, the accountants, ministers, courtiers, gatekeepers, and councilors also broke down in tears and wept.

source: མཆི་མ་ལེགས་པར་ཕྱིས་ནས། རྒྱལ་པོ་གསེར་མདོག་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་རྒྱལ་པོ་གསེར་མདོག་གི་རྐང་པ་གཉིས་ལ་ཕྱག་འཚལ་ཏེ། ཐལ་མོ་སྦྱར་ནས། རྒྱལ་པོ་གསེར་མདོག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བདག་ཅག་གིས་ལྷའི་ཞལ་ལྟ་བའི་ཕྱི་མ་དེང་ལགས་ཏེ།
en: Wiping away their tears, they approached King Kanakavarṇa, bowed their heads at his feet, and with folded hands said to King Kanakavarṇa, ‘Today is our last sight of Your Majesty.

source: བདག་ཅག་གིས་གང་ཅུང་ཟད་ལྷའི་བཀའ་ལ་འགལ་བ་ཅི་བགྱིས་པ་བཟོད་པར་གསོལ་ལོ། །
en: Please forgive us for anything we have done contrary to Your Majesty’s instruction.’

source: འདི་ལྟ་སྟེ་བཅོམ་ལྡན་འདས་རང་སངས་རྒྱས་དེས་བསོད་སྙོམས་དེ་ཡོངས་སུ་ཟོས་སོ། །དེ་ནས་སྐད་ཅིག་དེ་ཉིད་ལ་ཕྱོགས་བཞི་ཀུན་ནས་སྤྲིན་སྟུག་པོ་བཞི་ལངས་སོ། །རླུང་གྲང་བ་ཡང་ལངས་ཏེ། དེའི་ཚེ་འཛམ་བུའི་གླིང་ཕྱགས་སོ། །
en: “But just as that blessed pratyekabuddha finished eating the alms, at that very moment, four masses of clouds emerged from all four directions, and cool winds began to blow that swept Jambudvīpa clean.

source: དེ་ནས་དེའི་དུས་ཀྱི་བྱེ་བྲག་ལ་བཅའ་བར་བྱ་བ་དང་། བཟའ་བར་བྱ་བ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཆར་བབ་སྟེ། བཟའ་བར་བྱ་བའི་དངོས་པོ་འདི་ལྟ་བུ་འབྲས་ཆན་དང་། ཕྱེ་དང་།
en: And then, during the second half of that day, it rained various kinds of foods and edible things.

source: ཟན་དྲོན་དང་། ཤ་དང་། ཉ་ཤ་དང་། བཟའ་བར་བྱ་བའི་དངོས་པོ་འདི་ལྟ་བུ། བཅའ་བར་བྱ་བ་ལ་ཕུག་དང་།
en: There were foods such as boiled rice, sattu, khichri, meat, and fish.

source: བཟའ་བར་བྱ་བ་ལོ་མ་དང་། བཟའ་བར་བྱ་བ་མེ་ཏོག་དང་། བཟའ་བར་བྱ་བ་འབྲས་བུ་དང་། བཟའ་བར་བྱ་བ་ཏིལ་དང་། བཟའ་བར་བྱ་བ་ཏིལ་མར་དང་།
en: There were edible things such as edible roots, stalks, leaves, flowers, fruits, sesame, sesame oil, jaggery, and cane sugar.

source: བཟའ་བར་བྱ་བ་བུར་མར་དང་། བཟའ་བར་བྱ་བ་ཁ་ར་དང་། གཞན་ཡང་བཟའ་བར་བྱ་བ་དང་། བཅའ་བར་བྱ་བ་དང་། མྱང་བར་བྱ་བ་རྣམ་པ་མང་པོའི་བཟའ་བ་དག་གི་ཆར་བབ་བོ། །
en: And there were many other kinds of foods, edible things, and delicacies that rained down.

source: དེ་ནས་རྒྱལ་པོ་གསེར་མདོག་མགུ་ལ་དགའ་ཞིང་ཡི་རངས་ཏེ། རབ་ཏུ་དགའ་ནས་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ཏེ། རྩིས་པ་དང་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་དང་བློན་པོ་དང་སྒོ་བ་དང་འཁོར་རྣམས་བོས་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །གྲོང་གི་གཙོ་བོ་དག་ལྟོས་ཤིག །
en: “King Kanakavarṇa was thrilled, exalted, and elated, and as he rejoiced, full of rapture and gladness, he said to his accountants, ministers, courtiers, gatekeepers, and councilors, ‘Look, sirs!

source: ཀྱེ་མ་དེང་བསོད་སྙོམས་གཅིག་ཕུལ་བའི་མྱུ་གུ་བྱུང་བར་གྱུར་ཏེ།
en: Right now the sprout of giving that single portion of alms has appeared!

source: འབྲས་བུ་དང་ལོ་མ་དང་མེ་ཏོག་ནི་ཕྱིས་འབྱུང་བར་འགྱུར་རོ། །
en: Fruits, leaves, and flowers will come later!’

source: དེ་ནས་ཉི་མ་གཉིས་པ་ལ་ཉིན་བདུན་དུ་ནོར་དང་འབྲུའི་ཆར་རབ་ཏུ་བབ་བོ། །འདི་ལྟ་སྟེ་ཏིལ་དང་། འབྲས་ཐུག་པོ་ཆེ་དང་། མོན་སྲན་གྲེའུ་དང་། མོན་སྲན་དཀར་རུ་དང་།
en: “On the second day, a week-long rain of goods and grains began.

source: ནས་དང་། གྲོ་དང་། སྲན་ཆུང་དང་། འབྲས་སཱ་ལུ་དང་། འབྲུའི་རིགས་ཐམས་ཅད་དང་ཞག་བདུན་དུ་མར་སར་གྱི་ཆར་བབ་བོ། །
en: For seven days it rained sesame, rice, mung beans, black gram, barley, wheat, lentils, white rice, and all types of grains.

source: ཞག་བདུན་དུ་ཏིལ་མར་གྱི་ཆར་བབ་བོ། །
en: For seven days it rained ghee.

source: ཞག་བདུན་དུ་བེའུ་རས་ཀྱི་ཆར་བབ་བོ། །
en: For seven days it rained sesame oil. For seven days it rained cotton cloth.

source: ཞག་བདུན་དུ་ཟས་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཆར་བབ་བོ། །ཞག་བདུན་དུ་རིན་པོ་ཆེ་སྣ་བདུན་ལ། གསེར་དང་། དངུལ་དང་། ཤེལ་དང་།
en: For seven days it rained various kinds of materials.

source: བཻ་དཱུརྱ་དང་། མུ་ཏིག་དམར་པོ་དང་། རྡོའི་སྙིང་པོ་དང་། སྤུག་རྣམས་ཏེ། རིན་པོ་ཆེ་སྣ་བདུན་པོ་འདི་དག་གི་ཆར་བབ་བོ། །
en: And for seven days it rained the seven precious substances, namely, gold, silver, crystal, beryl, ruby, emerald, and sapphire.

source: རྒྱལ་པོ་གསེར་མདོག་གི་མཐུས། འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་ཀྱི་དབུལ་བ་ཡང་དག་པར་བཅད་པར་གྱུར་ཏོ། །
en: “So, by the power of King Kanakavarṇa, there was a complete end to poverty for all the people of Jambudvīpa.

source: དགེ་སློང་དག་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་སྙམ་དུ་ཁྱེད་ཀྱིས་སོམ་ཉི་དང་ཡིད་གཉིས་སུ་མི་བྱའོ། །
en: “Monks, you might be uncertain or in doubt, thinking that it was someone else who was King Kanakavarṇa at that time, at that moment.

source: དགེ་སློང་དག་དེའི་ཚེ་དེའི་དུས་ན།
en: But, monks, it should not be seen in this way.

source: རྒྱལ་པོ་གསེར་མདོག་ཅེས་བྱ་བ་བྱུང་བ་དེ་ནི། ང་ཉིད་ཡིན་པར་བལྟ་བར་བྱའོ། །
en: I was that king named Kanakavarṇa at that time, at that moment.

source: དགེ་སློང་དག་རྣམ་གྲངས་དེས་ཀྱང་འདི་ལྟར་རིག་པར་བྱ་སྟེ། ཇི་ལྟར་ངས་སྦྱིན་པའི་འབྲས་བུ་དང་སྦྱིན་པ་ལ་འགེད་པའི་རྣམ་པར་སྨིན་པ་ཤེས་པ་ལྟར། སེམས་ཅན་རྣམས་ཀྱིས་ཀྱང་སྦྱིན་པའི་འབྲས་བུ་དང་སྦྱིན་པ་ལ་འགེད་པའི་རྣམ་པར་སྨིན་པ་ཤེས་པར་གྱིས་ཤིག །
en: “Monks, through this teaching, this should be understood: One should know the fruit of giving and the karmic fruition of sharing gifts as I know the fruit of giving and the karmic fruition of sharing gifts.

source: གང་ཁམ་ཕྱི་མའི་ཁམ་ཕྱི་མ་གཅིག་པོ་དེ་ཡང་གཞན་དག་ལ་མ་བྱིན་མ་བགོས་པར་བདག་གི་བར་མི་བྱའོ། །སེར་སྣའི་སེམས་ཀྱི་དྲི་མ་སྐྱེས་པ་ཀུན་ནས་དཀྲིས་ཏེ་འདུག་པར་མི་བྱའོ། །
en: One should not eat the last mouthful, the last morsel, oneself—without giving it or sharing it with others—and the arisen defilement of selfishness will not remain in possession of one’s mind.

source: ཇི་ལྟར་ངས་ཤེས་པ་དེ་བཞིན་དུ། འདི་ལྟར་སེམས་ཅན་དག་གི་སྦྱིན་པ་དང་སྦྱིན་པ་ལ་འགེད་པའི་རྣམ་པར་སྨིན་པ་མི་ཤེས་ཏེ། དེ་ལྟ་བས་ན་སེམས་ཅན་དག་གང་ཁམ་ཕྱི་མ་ཕྱི་མའི་ཁམ་གཅིག་པོ་དེ་ཡང་གཞན་དག་ལ་མ་བྱིན་མ་བགོས་པར་བདག་ཉིད་ཀྱིས་བཟའ་བར་མི་བྱའོ། །སེར་སྣའི་སེམས་ཀྱི་དྲི་མ་སྐྱེས་པས་ཀུན་ནས་དཀྲིས་ཏེ་འདུག་པར་མི་བྱའོ། །
en: But because beings do not know the fruit of giving and the karmic fruition of sharing gifts as I know the fruit of giving and the karmic fruition of sharing gifts, they eat even their last mouthful, their last morsel, themselves—without giving, without sharing it with others—and the arisen defilement of selfishness remains in possession of their minds.

source: སྔོན་གྱི་དགེ་དང་མི་དགེ་བྱས་པ་ཆུད་མི་ཟ། །མཁས་པ་དག་ལ་བརྟེན་པ་ཆུད་ནི་མི་ཟ་སྟེ། །འཕགས་པའི་སྐྱེ་བོས་ལེགས་པར་བཤད་པ་ཆུད་མི་ཟ། །བྱས་པ་གཟོ་ལ་བྱས་པ་རྣམས་ཀྱང་ཆུད་མི་ཟ། །
en: Past deeds, virtuous or unvirtuous, do not perish, To have attended upon the wise does not perish, What is well said by the noble does not perish, What is done for the grateful does not perish.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: This is what the Blessed One said.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་དགེ་སློང་དེ་དག་དང་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དང་དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: Elated, the bodhisattvas, monks, and the world with its gods, humans, asuras, and gandharvas rejoiced at what the Blessed One had said.

source: གསེར་མདོག་གི་སྔོན་གྱི་སྦྱོར་བ་ཞེས་བྱ་བ་རྫོགས་སོ།།
en: This concludes “The Past Endeavor of Kanakavarṇa.”
